DOMAIN = "evse_energy_star"
DEFAULT_SCAN_INTERVAL = 30  # 🕒 Скориговано для стабільності ESP

TITLE = "EVSE Energy Star"  # 🔖 Може використовуватись у конфігурації або UI

# 📋 Карта статусів EVSE
STATUS_MAP = {
    0: "Немає даних",
    6: "Заряд",
    9: "Очікування",
    12: "Готовий",
    13: "Відкладений старт",
    14: "Перевищення струму",
    15: "Перевищення напруги",
    16: "Витік",
    17: "Помилка станції",
    18: "Перевищення температури",
    19: "Заблоковано",
    20: "Немає заземлення",
    21: "Перегрів вилки",
    22: "Низька напруга",
}